[
    {
        "id": "asset1",
        "title": "Step Brothers",
        "description": "Brennan Huff, a sporadically employed thirty-nine-year-old who lives with his mother, Nancy. Dale Doback, a terminally unemployed forty-year-old who lives with his father, Robert. When Robert and Nancy marry and move in together, Brennan and Dale are forced to live with each other as step brothers.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0RM6YREXZQ4B/600x337.webp",
        "duration": 5873,
        "uploadDate": "2023-06-08T04:00:00.000Z"
    },
    {
        "id": "asset2",
        "title": "Talladega Nights: The Ballad Of Ricky Bobby",
        "description": "NASCAR superstar Ricky Bobby (Will Ferrell) is at the top of his game; adored by fans, a trophy wife by his side, and incredible wealth. But Ricky loses it all when French Formula One champion Jean Girard (Sacha Baron Cohen) roars onto the scene. Ricky, with the help of his ruthless father, must pull himself out of the depths of despair and restore his honor on the racetrack.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0DZXYEYD92GY/600x337.webp",
        "duration": 6484,
        "uploadDate": "2023-06-08T04:00:00.000Z"
    },
    {
        "id": "asset3",
        "title": "Raw Deal",
        "description": "Dismissed some time ago from the FBI, Mark Kaminsky is contacted by his old boss, Shannon, whose son has been murdered. Determined to find the assassin, Shannon needs Kaminsky's help and offers to re-instate him if he is successful. Kaminsky assumes a new identity and moves to Chicago where he ingratiates himself with the underworld. To be successful, it is vital he is accepted by the gangsters",
        "image": "https://image.xumo.com/v1/assets/asset/XM029FT7ZESDQ5/600x337.webp",
        "duration": 6344,
        "uploadDate": "2023-06-01T04:00:00.000Z"
    },
    {
        "id": "asset4",
        "title": "Made",
        "description": "In this comedic crime drama, aspiring boxer Bobby (Jon Favreau) and pal Ricky (Vince Vaughn) head to New York as representatives of Los Angeles mob boss Max (Peter Falk). Things aren't going well with Bobby's job, his boxing dreams or his girlfriend (Famke Janssen), and he hopes that helping out Max will fix it. But trouble hits when the two meet up with Ruiz (Sean Combs) and the gangsters of New York.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0TJ66B1O4BYX/600x337.webp",
        "duration": 5681,
        "uploadDate": "2023-06-01T04:00:00.000Z"
    },
    {
        "id": "asset5",
        "title": "Bad Boys (1983)",
        "description": "Academy Award® winner Sean Penn is Mick O'Brien, a rough Chicago teen torn between petty crime and the love of his girlfriend (Ally Sheedy). But when the heist of a local drug dealer (Esai Morales) goes tragically wrong, Mick is sentenced to a brutal juvenile prison where violence is a rite of passage and respect is measured in vengeance. Is Mick headed for a life of crime - or can he find the strength to turn himself around before it's too late?",
        "image": "https://image.xumo.com/v1/assets/asset/XM00MBAD69XOCD/600x337.webp",
        "duration": 7418,
        "uploadDate": "2023-06-01T04:00:00.000Z"
    },
    {
        "id": "asset6",
        "title": "Catch the Bullet",
        "description": "This powerful Western, starring Peter Facinelli (TWILIGHT franchise), shows what happens when you push a good man too far. Britt MacMasters, a U.S. Marshal, returns from a mission to find his father (Tom Skerritt) wounded and his son, Chad, kidnapped by the outlaw Jed Blake. Hot on their trail, Britt forms a posse with a gunslinging deputy and a stoic Pawnee tracker.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0XGTNQLZXF63/600x337.webp",
        "duration": 5335,
        "uploadDate": "2023-03-30T00:00:00.000Z"
    },
    {
        "id": "asset7",
        "title": "The Drone",
        "description": "This terrifying, outrageous tale takes flight as a serial killer is struck by lightning while holding his precious drone. Weeks later, the drone shows up at the home of newlywed couple Chris (John Brotherton, THE CONJURING) and Rachel (Alex Essoe, STARRY EYES). Without them realizing it, the drone films the couple and takes control of their TV, computer, security system, and car. Soon, Chris and Rachel fear that the device may be connected to them...and is out for horrific, hovering revenge.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0EIF4BCQLWWI/600x337.webp",
        "duration": 4914,
        "uploadDate": "2023-06-08T04:00:00.000Z"
    },
    {
        "id": "asset8",
        "title": "Phantom",
        "description": "Long-troubled by a catastrophic event for which he shares some of the blame, Soviet submarine Capt. Demi (Ed Harris), nevertheless, agrees to lead one final mission aboard the B-67, a vessel which is soon to be sold to the Chinese navy. Demi's compromised mental state leaves him ill-prepared to deal with the situation posed by a technician (David Duchovny) who -- acting on top-secret orders -- seizes control of the sub. His orders: Start World War III and shift the blame to the Chinese.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0EYFK3QD61LX/600x337.webp",
        "duration": 5905,
        "uploadDate": "2023-06-01T04:00:00.000Z"
    },
    {
        "id": "asset9",
        "title": "I Love You Phillip Morris",
        "description": "The true story of a charismatic con man's journey from small-town businessman to white-collar criminal, who's come out of the closet and repeatedly finds himself in trouble with the law. In prison, he meets the second love of his life, whom he'll stop at nothing to be with.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0RUS15THLLT1/600x337.webp",
        "duration": 5809,
        "uploadDate": "2021-04-30T00:00:00.000Z"
    },
    {
        "id": "asset10",
        "title": "Doc Holliday",
        "description": "Doc Holliday runs a small dental practice in rural Georgia when he is visited by Wyatt Earp and offered a chance to become a United States Deputy. All Doc has to do is capture the Bridle Brothers - two of the most notorious outlaws the West has ever seen. The Doc sets out on an adventure like none other to find these hardened criminals and ends up forging a friendship with Wyatt Earp that would carry into the events of Tombstone.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0KLO5UBLRFZ7/600x337.webp",
        "duration": 5558,
        "uploadDate": "2023-03-01T00:00:00.000Z"
    },
    {
        "id": "asset11",
        "title": "Before I Go to Sleep",
        "description": "Ever since a vicious attack nearly claimed her life, Christine Lucas (Nicole Kidman) has suffered from anterograde amnesia and is unable to form new memories. Every morning, she becomes reacquainted with her husband, Ben (Colin Firth), and the other constants in her life. In accordance with her doctor's (Mark Strong) instructions, Christine keeps a video diary. As Christine starts to uncover terrifying truths about her past, she begins to question everything -- and everyone -- around her.",
        "image": "https://image.xumo.com/v1/assets/asset/XM02Y0WAVNZYGJ/600x337.webp",
        "duration": 5507,
        "uploadDate": "2020-09-05T00:00:00.000Z"
    },
    {
        "id": "asset12",
        "title": "Ghosts of the République",
        "description": "Confronted by France's conservative surrogacy laws, a gay couple, travel to Las Vegas to start a family through surrogacy. This film shows the lengths many gay couples go to have children, examining the controversial surrogacy industry.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0VUXA2B39TH4/600x337.webp",
        "duration": 4840,
        "uploadDate": "2022-11-05T02:00:13.000Z"
    },
    {
        "id": "asset13",
        "title": "Born In Chicago",
        "description": "In 1960, a group of white teenage Chicago musicians traveled to the city's southside music clubs to learn the blues from the original masters. This is their story.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0XED8O2QL2VG/600x337.webp",
        "duration": 4619,
        "uploadDate": "2023-08-01T23:02:21.000Z"
    },
    {
        "id": "asset14",
        "title": "Fight the Good Fight",
        "description": "After his eldest son is murdered in a gangland hit, an absentee father desperately tries to protect what's left of the shattered family he abandoned.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0MB8WLNB5LGJ/600x337.webp",
        "duration": 5799,
        "uploadDate": "2022-04-29T22:37:52.000Z"
    },
    {
        "id": "asset15",
        "title": "Believe",
        "description": "A small-town business owner tries to save the local Christmas pageant against all odds.",
        "image": "https://image.xumo.com/v1/assets/asset/XM04A3FTP58C1X/600x337.webp",
        "duration": 7173,
        "uploadDate": "2022-04-01T23:00:40.000Z"
    },
    {
        "id": "asset16",
        "title": "Thy Will Be Done",
        "description": "A Gospel Movie Musical Based on the Hit Play - A Gospel Movie Musical Based on the Hit Play. An ex-pastor, whose church was destroyed during Hurricane Katrina, loses his faith and becomes a homeless wanderer. After surviving a near death experience, he mysteriously awakens in a church that is in desperate need of a pastor.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0C7UH6YAVE0A/600x337.webp",
        "duration": 5284,
        "uploadDate": "2020-12-13T08:33:31.000Z"
    },
    {
        "id": "asset17",
        "title": "Heaven's Messenger",
        "description": "A doctor tries to solve the mystery of a man with no name, multiple personalities, and burns on his hands. Who is he and what happened to him?",
        "image": "https://image.xumo.com/v1/assets/asset/XM0TVG8H1H4JD2/600x337.webp",
        "duration": 5024,
        "uploadDate": "2021-02-24T09:07:31.000Z"
    },
    {
        "id": "asset18",
        "title": "Gumshoe",
        "description": "Hopeless New Orleans private eye Biff Basham becomes entangled in a web of blackmail, espionage and murder in this crazy comedy.",
        "image": "https://image.xumo.com/v1/assets/asset/XM00R8AY8VR37B/600x337.webp",
        "duration": 5645,
        "uploadDate": "2022-10-03T16:55:40.000Z"
    },
    {
        "id": "asset19",
        "title": "Valiant",
        "description": "The powerful story of the Vegas Golden Knights in their very first year of existence, when they healed and unified their home city after the worst mass shooting in U.S. history and took an unprecedented run for the Stanley Cup.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0732DB0MFUS5/600x337.webp",
        "duration": 5604,
        "uploadDate": "2020-06-09T22:00:04.000Z"
    },
    {
        "id": "asset20",
        "title": "Hyena Road",
        "description": "Three different men, three different worlds, three different wars - all stand at the intersection of modern warfare - a murky world of fluid morality where all is not as it seems.",
        "image": "https://image.xumo.com/v1/assets/asset/XM01AW64P65F77/600x337.webp",
        "duration": 7291,
        "uploadDate": "2020-03-05T08:44:27.000Z"
    },
    {
        "id": "asset21",
        "title": "The Monkey King: Havoc In Heaven's Palace",
        "description": "A monkey born from heavenly stone must battle the armies of both gods and demons to find his place in the heavens. Based on \"Journey to the West\".",
        "image": "https://image.xumo.com/v1/assets/asset/XM0X4FJE1LSVCH/600x337.webp",
        "duration": 7323,
        "uploadDate": "2018-12-13T19:25:01.000Z"
    },
    {
        "id": "asset22",
        "title": "Deep Shock",
        "description": "A mysterious trench forms on the ocean floor and a deadly species of creature emerges from the depths.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0K83KS9K1229/600x337.webp",
        "duration": 5570,
        "uploadDate": "2021-10-22T23:00:35.000Z"
    },
    {
        "id": "asset23",
        "title": "Mom Murder and Me",
        "description": "What does it take to admit your overprotective mother is right? When Annabel's elderly neighbor passes away, Joan insists it's murder. Without evidence for the police, Annabel blunders through a comical investigation with Joan as her only ally and a murderer who may be on to their amateur sleuthing.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0XBUGTTF1F77/600x337.webp",
        "duration": 5521,
        "uploadDate": "2020-04-22T08:13:52.000Z"
    },
    {
        "id": "asset24",
        "title": "The Square",
        "description": "Oscar nominated documentary which depicts the ongoing Egyptian revolution. - The Square is one of the most awarded documentaries of the past decade, nominated for a 2014 Academy Award for \"Best Documentary Feature\" and winning 3 Emmy Awards, as well as multiple film festivals including the Audience Awards at the 2013 Sundance and Toronto Film Festivals. The film is a in depth first hand look at the Egyptian Revolution chronicling the fall of two Presidents in a row",
        "image": "https://image.xumo.com/v1/assets/asset/XM0XT3GEG0ZP3B/600x337.webp",
        "duration": 6285,
        "uploadDate": "2020-07-28T04:08:15.000Z"
    },
    {
        "id": "asset25",
        "title": "Traded",
        "description": "In the 1880s western \"Traded\", a father must leave his ranch for Dodge City to save his daughter from an old enemy, putting his reputation as the fastest draw in the west to the test.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0LHOLF1YCF4J/600x337.webp",
        "duration": 5903,
        "uploadDate": "2022-04-01T23:00:41.000Z"
    },
    {
        "id": "asset26",
        "title": "The Starfish Throwers",
        "description": "Worlds apart, a five-star chef, a twelve-year-old girl, and a retired schoolteacher discover how their individual efforts to feed the poor ignite a movement in the fight against hunger.",
        "image": "https://image.xumo.com/v1/assets/asset/XM0X3A4W1NYHSK/600x337.webp",
        "duration": 4970,
        "uploadDate": "2023-07-29T02:00:17.000Z"
    }
]